# IsCurved Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Grid..::..IsCurved Property
Grid Class See Also
---
Identifies if the grid line is curved or straight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsCurved { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCurved As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCurved {
	bool get ();
}
```

# Remarks
A value of True is returned if the grid line is an arc or False if the grid line is straight. Use the Curve property to retrieve an object that represents the geometry of the grid line.
# See Also
Grid Class
Autodesk.Revit.DB Namespace